app/controllers/accounts_controller.rb

  def create
    @account = Account.new(account_params)

    respond_to do |format|
      if @account.save
---
INSERT INTO "accounts" ("account_number", "created_at", "updated_at") VALUES (?, ?, ?)  [["account_number", "0---------4"], ["created_at", "2017-08-02 08:54:20.280301"], ["updated_at", "2017-08-02 08:54:20.280301"]]