app/controllers/transactions_controller.rb

  def create
    @account = Account.find(params[:account_id])
    @transaction = @account.transactions.create(transaction_params)
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "transactions" ("account_id", "date", "category", "comment", "amount", "done", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)